_site/org/2016-04-05-mysql_slow_log.org
#+BEGIN_HTML
---
layout: post
title: mysql性能剖析之slow_log
---
#+END_HTML
#+OPTIONS: toc:nil
#+OPTIONS: ^:nil

slow_log记录了mysql的慢查询，是分析性能的重要数据来源。
* slow_log
  顾名思义，slow_log里面记录了mysql中比较慢的查询。
** 怎样算慢
   mysql使用long_query_time这个系统参数来定义慢查询的界限，比long_query_time的时间还要长就认为是慢查询，long_query_time的最小值和默认值分别是0和10。
   在mysql中可以查看这个参数的值
   #+BEGIN_SRC sh
     mysql> show variables like '%long_query_time%';
     +-----------------+-----------+
     | Variable_name   | Value     |
     +-----------------+-----------+
     | long_query_time | 10.000000 |
     +-----------------+-----------+
   #+END_SRC   
   
** 开启慢查询记录
   默认情况下，慢查询日志是未启用的。使用--slow_query_log[={0|1}]参数在mysql server启动时控制是否打开慢查询日志。

** 慢查询日志放在什么地方
   - mysql server启动的参数中--slow_query_log_file=file_name指定slow_log的文件位置
   - 默认情况下slow_query_log_file=*host_name*-slow.log，放在mysql目录。
   - 运行时可以通过修改slow_log_query系统参数来启用或者禁用slow_log，修改slow_log_query_file来修改slow_log的文件名。
   在mysql中查看slow_log相关的参数
   #+BEGIN_SRC sh
     mysql> show variables like '%slow%';
     +---------------------+-------------------------------------------+
     | Variable_name       | Value                                     |
     +---------------------+-------------------------------------------+
     | log_slow_queries    | OFF                                       |
     | slow_launch_time    | 2                                         |
     | slow_query_log      | OFF                                       |
     | slow_query_log_file | /var/lib/mysql/guang-Aspire-4750-slow.log |
     +---------------------+-------------------------------------------+
   #+END_SRC
** 开启慢查询
   #+BEGIN_SRC sh
     mysql> set slow_query_log='ON';
     ERROR 1229 (HY000): Variable 'slow_query_log' is a GLOBAL variable and should be set with SET GLOBAL
     mysql> set global slow_query_log='ON';
     Query OK, 0 rows affected (0.00 sec)

     mysql> show variables like '%slow%';
     +---------------------+-------------------------------------------+
     | Variable_name       | Value                                     |
     +---------------------+-------------------------------------------+
     | log_slow_queries    | ON                                        |
     | slow_launch_time    | 2                                         |
     | slow_query_log      | ON                                        |
     | slow_query_log_file | /var/lib/mysql/guang-Aspire-4750-slow.log |
     +---------------------+-------------------------------------------+
   #+END_SRC
   修改slow_query_log_file的位置：
   #+BEGIN_SRC sh
     mysql> SET GLOBAL slow_query_log_file = '/home/guang/slow-log';
     ERROR 1231 (42000): Variable 'slow_query_log_file' can't be set to the value of '/home/guang/slow-log'

     mysql> set global slow_query_log_file = '/var/lib/mysql/slow.log';
     Query OK, 0 rows affected (0.01 sec)        
   #+END_SRC
   猜测是只有用户或者用户组是mysql并且有写权限的目录才能设置成log目录。

   
   
   
   
   
