_site/2016/04/05/mysql_slow_log.html
<!DOCTYPE html>
<html>

  <head>
  <title>mysql性能剖析之slow_log</title>
  <!-- link to main stylesheet -->
  <link rel="stylesheet" type="text/css" href="/assets/css/main.css">
  <link rel="stylesheet" type="text/css" href="/assets/css/font-awesome-4.6.1/css/font-awesome.min.css">
</head>


  <body>
    <article class="content">
      <h1 class="post-title">mysql性能剖析之slow_log</h1>
      <p>
        
        
        
      </p>

      <p>
slow_log记录了mysql的慢查询，是分析性能的重要数据来源。
</p>
<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> slow_log</h2>
<div class="outline-text-2" id="text-1">
<p>
顾名思义，slow_log里面记录了mysql中比较慢的查询。
</p>
</div>
<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> 怎样算慢</h3>
<div class="outline-text-3" id="text-1-1">
<p>
mysql使用long_query_time这个系统参数来定义慢查询的界限，比long_query_time的时间还要长就认为是慢查询，long_query_time的最小值和默认值分别是0和10。
在mysql中可以查看这个参数的值
</p>
<div class="org-src-container">

<pre class="src src-sh">mysql&gt; show variables like <span style="color: #8b2252;">'%long_query_time%'</span>;
+-----------------+-----------+
| Variable_name   | Value     |
+-----------------+-----------+
| long_query_time | 10.000000 |
+-----------------+-----------+
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 开启慢查询记录</h3>
<div class="outline-text-3" id="text-1-2">
<p>
默认情况下，慢查询日志是未启用的。使用&#x2013;slow_query_log[={0|1}]参数在mysql server启动时控制是否打开慢查询日志。
</p>
</div>
</div>

<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 慢查询日志放在什么地方</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>mysql server启动的参数中&#x2013;slow_query_log_file=file_name指定slow_log的文件位置
</li>
<li>默认情况下slow_query_log_file=*host_name*-slow.log，放在mysql目录。
</li>
<li>运行时可以通过修改slow_log_query系统参数来启用或者禁用slow_log，修改slow_log_query_file来修改slow_log的文件名。
</li>
</ul>
<p>
在mysql中查看slow_log相关的参数
</p>
<div class="org-src-container">

<pre class="src src-sh">mysql&gt; show variables like <span style="color: #8b2252;">'%slow%'</span>;
+---------------------+-------------------------------------------+
| Variable_name       | Value                                     |
+---------------------+-------------------------------------------+
| log_slow_queries    | OFF                                       |
| slow_launch_time    | 2                                         |
| slow_query_log      | OFF                                       |
| slow_query_log_file | /var/lib/mysql/guang-Aspire-4750-slow.log |
+---------------------+-------------------------------------------+
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 开启慢查询</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-sh">mysql&gt; set <span style="color: #a0522d;">slow_query_log</span>=<span style="color: #8b2252;">'ON'</span>;
ERROR 1229 (HY000): Variable <span style="color: #8b2252;">'slow_query_log'</span> is a GLOBAL variable and should be set with SET GLOBAL
mysql&gt; set global <span style="color: #a0522d;">slow_query_log</span>=<span style="color: #8b2252;">'ON'</span>;
Query OK, 0 rows affected (0.00 sec)

mysql&gt; show variables like <span style="color: #8b2252;">'%slow%'</span>;
+---------------------+-------------------------------------------+
| Variable_name       | Value                                     |
+---------------------+-------------------------------------------+
| log_slow_queries    | ON                                        |
| slow_launch_time    | 2                                         |
| slow_query_log      | ON                                        |
| slow_query_log_file | /var/lib/mysql/guang-Aspire-4750-slow.log |
+---------------------+-------------------------------------------+
</pre>
</div>
<p>
修改slow_query_log_file的位置：
</p>
<div class="org-src-container">

<pre class="src src-sh">mysql&gt; SET GLOBAL <span style="color: #a0522d;">slow_query_log_file</span> = <span style="color: #8b2252;">'/home/guang/slow-log'</span>;
ERROR 1231 (42000): Variable <span style="color: #8b2252;">'slow_query_log_file'</span> can<span style="color: #8b2252;">'t be set to the value of '</span>/home/guang/slow-log<span style="color: #8b2252;">'</span>

<span style="color: #8b2252;">mysql&gt; set global slow_query_log_file = '</span>/var/lib/mysql/slow.log<span style="color: #8b2252;">';</span>
<span style="color: #8b2252;">Query OK, 0 rows affected (0.01 sec)</span>
</pre>
</div>
<p>
猜测是只有用户或者用户组是mysql并且有写权限的目录才能设置成log目录。
</p>
</div>
</div>
</div>

    </article>
  </body>
</html>
